#Да се състави програма, чрез която се въвежда 4-цифренo естествено число от интервала [1000.. 9999]. От това число се формират 2 нови 2-цифрени числа. 
#Първото число се формира от 1-та и 4-та цифра на въведеното число. Второто число се формира от 2-рa - 3-та цифра на въведеното число. 
#На екрана да се изведе дали 1-то ново число e по-малко <, равно = или по-голямо от 2-то число.
#Използвайте проверка на логическо условие - оператор if.
#Пример: 3332 Изход: по-малко (32<33)
#Пример: 1144 Изход: равни (14=14)
#Пример: 9875 Изход: по-голямо (95>87)


try:
    x = input('Enter 4 digit integer number: ')
    x_control=int(x)
    if x_control<1000 or x_control>9999:
        print('Number must contain 4 digits')
        exit()
    str1 = x[0] + x[3]
    str2 = x[1] + x[2]
    num1 = int(str1)
    num2 = int(str2)

    if num1<num2:
        print('по-малко (',num1,'<',num2,')')
    elif num1==num2:
        print('равни (',num1,'=',num2,')')
    else:
        print('по-голямо (',num1,'>',num2,')')


except:
    print('Follow instructions and enter 4 digit integer number')
