# Да се създаде програма, която да чете цели числа въведени от потребителя,
# докато не бъде въведен празен ред. След като всичките числа са прочетени, програмата
# трябва да показва всички отрицателни числа, последвани от нули, последвани от всички
# положителни числа. Във всяка група номерата трябва да се показват в същия ред, в
# който са въведени от потребителя. Например, ако потребителят въведе стойностите 3, -
# 4, 1, 0, -1, 0 и -2, вашата програма трябва да изведе стойностите -4, -1, -2, 0, 0, 3 и 1 .
# Вашата програма трябва да показва всяка стойност на нов ред.


x = 1
i = 1
txt = []
while x==True:
    try:
        num = input('Your enter: ')
        
        if num=='':
            break

        num = int (num)
    except:
        print('Invalid input ')
        continue

    
    if num not in txt:
        txt.append(num)
        i += 1
        
txt.sort()
print(*txt, sep = '\n')