#  Напишете програма, която чете цели числа въведени от потребителя и ги
# съхранява в списък. Програма трябва да продължи да чете стойности, докато
# потребителят не въведе 0. След това тя трябва да покаже всички стойности, въведени от
# потребителя (с изключение на 0), подредени от най-малката до най-голямата стойност,
# като на всеки ред се появява по една стойност. Използвайте или метода за сортиране,
# или функцията за сортиране на списъци.

x = 1
i = 1
txt = []
while x==True:
    try:
        num = int(input('Enter number: '))
    except:
        print('Enter integer number: ')
        continue

    if num==0:
        break
    else:
        txt.append(num)
        i+=1

txt.sort()

print(*txt, sep = '\n')